
--[[
      Программа выводит все доступные на момент CraftOS 1.4 символы
      в ComputerCraft на экран. Собственно, вся ее функция. Полезно, когда
      вы, к примеру, создаете новый шрифт для ComputerCraft, чтобы проверить,
      адекватно ли отображаются ваши корючки.
]]

-----------------------------------------------------------------------------------------------------------------------------------

print("1234567890-=qwertyuiop[]\asdfghjkl;\'zxcvbnm,./!@#$%^&*()_+QWERTYUIOP{}|ASDFGHJKL:\"ZXCVBNM<>, ")

-----------------------------------------------------------------------------------------------------------------------------------
