--[[
    Скрипт, скачивающий инсталлер прямиком с репозитория
    на Github. По сути, создан этот скрипт тупо для сокращения
    вводимой для установки команды в комьпютере =)
]]

-----------------------------------------------------------------------------------------------------------------------------------
-- Функция вывода ошибки о недоступности сайта github.com на пользовательском компьютере

function FancyError()
  term.setBackgroundColor(colors.black)
  term.clear()
  term.setCursorPos(1, 1)
  print("Can't connect to github.com")
end

-----------------------------------------------------------------------------------------------------------------------------------
-- Делаем запрос для скачивания инсталлера и проверяем наличие ответа от сервера

local link = "https://raw.githubusercontent.com/Markushka88/CCStuff/main/Installer/Installer.lua"
local response = http.get(link)

if not response then
	FancyError()
end

-----------------------------------------------------------------------------------------------------------------------------------
-- Создаем и запускаем скачанный файл Installer.lua

file = fs.open("Installer.lua", "w")
file.write(response.readAll())
file.close()

shell.run("Installer.lua")

-----------------------------------------------------------------------------------------------------------------------------------
