--[[
    Скрипт, так нужный почти всем пользователям
    SpeedOS, чтобы наконец удалить эту хуевину.
    Хз че дальше писать.
]]
 
-----------------------------------------------------------------------------------------------------------------------------------
-- Массив со списком файлов, относящимся по дефолту к ОС

local OSFiles = {"System", "SpeedAPI", "Programs", "Desktop", "startup", "crash", ".version"}

-----------------------------------------------------------------------------------------------------------------------------------
-- Пускаем цикл по этому массиву

for _, file in pairs(OSFiles) do
	fs.delete(file)
	sleep(0)
end

-----------------------------------------------------------------------------------------------------------------------------------
-- Перезагружаемся

os.reboot()

-----------------------------------------------------------------------------------------------------------------------------------
